ci4/app/Controllers/AdminController.php

    public function tampilkanRiwayatSemuaUser()
    {
        // Mendapatkan ID user dari data user saat ini (sesuaikan dengan implementasi Anda)
        $getTransaksi = $this->transaksiModel->findAll();
---
SELECT *
FROM `transaksi`

    public function editStatus($id)
    {

        if ($this->request->getMethod() === 'post') {
            $newStatus = $this->request->getPost('new_status');

            // update pwd user didb
            $this->transaksiModel->update($id, ['status' => ($newStatus)]);
---
UPDATE `transaksi` SET `status` = '1'
WHERE `transaksi`.`id` IN ('19')